hotRoom10B_noBottom/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
      type            atmBoundaryLayerInletVelocity;
      #include        "ABLConditions"
      value           uniform (0 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    bottom
    {
        type            noSlip;
    }

    top
    {
        type            fixedShearStress;
        tau             (0.12 0 0);
        value           uniform (0 0 0);
    }

    side01
    {
        type            symmetry;
    }

    side02
    {
        type            symmetry;
    }
}

// ************************************************************************* //
