hotRoom10B_noBottom/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     buoyantBoussinesqSimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         2000;

deltaT          0.1;

writeControl    timeStep;

writeInterval   500;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    #includeFunc CourantNo
    #includeFunc yPlus
    #include "sampleDict"
    
    velocity {
        type swakExpression;
        valueType internalField;
        verbose true;
        expression "U.x";
        accumulations (
            min
            weightedQuantile0.1
            weightedAverage
            weightedQuantile0.9
            max
        );
    }
    pressure {
        type swakExpression;
        valueType internalField;
        verbose true;
        expression "p";
        accumulations (
            min
            weightedQuantile0.1
            weightedAverage
            weightedQuantile0.9
            max
        );
    }
    nut {
        type swakExpression;
        valueType internalField;
        verbose true;
        expression "nut";
        accumulations (
            min
            weightedQuantile0.1
            weightedAverage
            weightedQuantile0.9
            max
        );
    }

    tke {
    type swakExpression;
    valueType internalField;
    verbose true;
    expression "k";
    accumulations (
        min
        weightedQuantile0.1
        weightedAverage
        weightedQuantile0.9
        max
    );
    }   

}


// ************************************************************************* //
